Revit 2027 API
BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanLandingBaseElevation Property
 Extend Below Base needs to be less than Landing Base Elevation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtendBelowBaseGreaterThanLandingBaseElevation { get; }
Public Shared ReadOnly Property ExtendBelowBaseGreaterThanLandingBaseElevation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtendBelowBaseGreaterThanLandingBaseElevation {
	FailureDefinitionId^ get ();
}
static member ExtendBelowBaseGreaterThanLandingBaseElevation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace